using System.Text;

namespace Fahrenheit.Mods.X2DSUnlimit;

//used for rendering - fetch data to fill, and update underlying data, not these directly?
// Populated by TOMenuMakeJobAbilityList
[StructLayout(LayoutKind.Explicit, Pack = 4, Size = 0x10)]
public struct DSAbilityListDataAbility {
    [FieldOffset(0x00)] public bool is_visible;
    [FieldOffset(0x01)] public bool b2;
    [FieldOffset(0x02)] public bool is_mastered;
    [FieldOffset(0x03)] public bool is_selected;
    [FieldOffset(0x04)] public uint ability_id;
    [FieldOffset(0x08)] public uint ap_current;
    [FieldOffset(0x0C)] public uint ap_needed;
}

[InlineArray(16)]
public struct DSAbilityListDataAbilityArray {
    private DSAbilityListDataAbility _element0;
}

// Populated by TOMenuMakeJobAbilityList, 0x110 per dressphere
// FFX-2.exe + DBB200 + (DS_ID * 0x110)
[StructLayout(LayoutKind.Explicit, Pack = 4, Size = 0x110)]
public struct DSAbilityListData {
    [FieldOffset(0x00)] public int i0;
    [FieldOffset(0x04)] public int ds_id;
    [FieldOffset(0x08)] public int percentage;
    [FieldOffset(0x0C)] public int i1;
    [FieldOffset(0x10)] public DSAbilityListDataAbilityArray Abilities;
}

public partial class X2DSUnlimitModule : FhModule {

    public void h_TOMenuSetSaveLearn(byte param_1, uint param_2, int param_3) {
        _TOMenuSetSaveLearn_handle.orig_fptr.Invoke(param_1, param_2, param_3);
        return;
    }

    public void h_TOMenuSetMacroCommandType(int param_1, int param_2, byte param_3) {
        _TOMenuSetMacroCommandType_handle.orig_fptr.Invoke(param_1, param_2, param_3);
        return;
    }

    public int h_TOBtlGetComName(uint param_1) {
        return _TOBtlGetComName_handle.orig_fptr.Invoke(param_1);
    }

    public void h_TOMenuSetMacroCommandValue(int param_1, int param_2, uint param_3) {
        _TOMenuSetMacroCommandValue_handle.orig_fptr.Invoke(param_1, param_2, param_3);
        return;
    }

    public uint h_TOGetMenuText(uint param_1) {
        return _TOGetMenuText_handle.orig_fptr.Invoke(param_1);
    }

    public uint h_SndSepPlaySimple(uint param_1) {
